Revit 2017 API
Space Members
The Space type exposes the following members.
Methods
Name | Description
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
Dispose |  (Inherited from Element.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetBoundarySegments
Returns the boundary segments.
 (Inherited from SpatialElement.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsPointInSpace
Determines if a point lies within the volume of the Space.
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ActualExhaustAirflow
Get the Actual Exhaust Airflow of the Space.
ActualHVACLoad
Get or set the Actual HVAC Load of the Space.
ActualLightingLoad
Get the Actual Lighting Load of the Space.
ActualOtherLoad
Get or set the Actual Other Load of the Space.
ActualPowerLoad
Get the Actual Power Load of the Space.
ActualReturnAirflow
Get or set the Actual Return Airflow of the Space.
ActualSupplyAirflow
Get or set the Actual Supply Airflow of the Space.
Area
The area.
 (Inherited from SpatialElement.)
AreaperPerson
Get the Area per Person of the Space.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
AverageEstimatedIllumination
Get the Average Estimated Illumination of the Space.
BaseHeatLoadOn
The heat load-on.
BaseOffset
Get or Set the Base Offset of the Space.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CalculatedCoolingLoad
Get the Calculated Cooling Load of the Space.
CalculatedHeatingLoad
Get the Calculated Heating Load of the Space.
CalculatedSupplyAirflow
Get or set the Calculated Supply Airflow of the Space.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CeilingReflectance
Get or set the Ceiling Reflectance of the Space.
ClosedShell
Return the closedShell of the space.
ConditionType
Get or set the Condition type of the Space.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignCoolingLoad
Get the Design Cooling Load of the Space.
DesignExhaustAirflow
Get or set the Specified Exhaust Airflow of the Space.
DesignHeatingLoad
Get the Design Heating Load of the Space.
DesignHVACLoadperArea
Get or set the Design HVAC Load per Area of the Space.
DesignLightingLoad
Get or set the Design Lighting Load of the Space.
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DesignOtherLoadperArea
Get or set the Design Other Load per Area of the Space.
DesignPowerLoad
Get or set the Design Power Load of the Space.
DesignReturnAirflow
Get or set the Specified Return Airflow of the Space.
DesignSupplyAirflow
Get or set the Specified Supply Airflow of the Space.
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
FloorReflectance
Get or set the Floor Reflectance of the Space.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LatentHeatGainperPerson
Get or set the Latent Heat Gain per Person of the Space.
Level
Gets the level of the room.
 (Inherited from SpatialElement.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LightingCalculationWorkplane
Get the Lighting Calculation Workplane of the Space.
LightingLoadUnit
Get or Set the Lighting Load Unit of the Space.
LimitOffset
Get or Set the Limit Offset of the Space.
Location
The location of the element.
 (Inherited from SpatialElement.)
Name
A human readable name for the Element.
 (Inherited from SpatialElement.)
Number
The number.
 (Inherited from SpatialElement.)
NumberofPeople
Get the Number of People of the Space.
OccupancyUnit
Get the Occupancy Unit of the Space.
Occupiable
Reports whether this zone is Occupiable or not.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Perimeter
The perimeter.
 (Inherited from SpatialElement.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Plenum
Reports whether this zone is Plenum or not.
PowerLoadUnit
Get or Set the Power Load Unit of the Space.
ReturnAirflow
Get or set the Return type of Supply Airflow of the Space.
Room
Return the Room of the space.
SensibleHeatGainperPerson
Get the Sensible Heat Gain per Person of the Space.
SpaceCavityRatio
Get the Space Cavity Ratio of the Space.
SpaceConstruction
Get the Space Construction of the Space.
SpaceType
Get or set the Space type of the Space.
UnboundedHeight
Get the Unbounded Height of the Space.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpperLimit
Get or Set the Upper Limit of the Space.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Volume
Get the Volume of the Space.
WallReflectance
Get or set the Wall Reflectance of the Space.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
Zone
Reports this space belong to which Zone.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace